#+TITLE: Stud.IP Cliqr - README
#+EMAIL: luniki@gmail.com
#+LANGUAGE: de
#+OPTIONS: toc:nil
#+OPTIONS: author:nil
#+OPTIONS: num:0

* Stud.IP Cliqr
** Beschreibung

Dieses Plugin ist eine (Software-)Audience Response System (Clicker), das sehr viel Wert auf einfache Bedienung für
Lehrende und Studierende legt. Als kleines Feature zeigt das Plugin die URL der Abstimmungsseite als QR-Code an. So
kommt das Plugin zu seinem Namen.

*** Wozu ist Stud.IP Cliqr gut?
Mit /Stud.IP Cliqr/ lässt sich ein so genanntes /Peer Instruction/ nach Eric Mazur durchführen. Dies ist eine Methode, mit
der die Studierenden in Vorlesungen besser eingebunden werden und die Möglichkeit erhalten, ihr Verständnis über die
vorgetragenen Lerninhalte zu überprüfen.

*** Wie geht das /Peer Instruction/?
Der Vortragende stellt alle 20-30 Minuten eine Frage mit mehreren Antwortoptionen (Single-Choice-Frage) ans Plenum.
Jeder Studierende ist aufgefordert, diese Frage zu beantworten. Seine Antwort wird mit /Stud.IP Cliqr/ statistisch
erfasst, d.h. der Lehrende sieht nun, welche Antwortoptionen das Plenum präferiert. Zur Beantwortung der Frage verwenden
die Studierenden ein mitgebrachtes, internetfähiges Endgerät, z.B. ihr Smartphone, Tablet oder Notebook und stimmen auf
einer Website ab. Je nachdem, ob das Plenum überwiegend auf die richtige Antwort getippt hat oder ob eher die falschen
Antwortoptionen gewählt wurden, führt der Lehrende seine Lehre fort.

Es wird die folgende Vorgehensweise empfohlen:

 - >80% der Studierenden haben richtig geantwortet: Der Lehrende gibt vertiefende Erklärungen zu den vorgetragenen Inhalten und wendet sich dann einem neuen Thema zu.
 - 30-80% haben richtig geantwortet: Der Lehrende fordert die Studierenden auf mit ihren Nachbarn über die Antwortoptionen zu diskutieren, um so auf das richtige Ergebnis zu kommen. Danach lässt er erneut abstimmen.
 - <30% der Studierenden haben richtig geantwortet: Der Lehrende erläutert noch mal die vorgetragenen Inhalte und lässt erneut abstimmen.

*** Was für Erfahrungen gibt es?

   Technologien wie /Stud.IP Cliqr/ haben eine große Verbreitung in
   den letzten Jahren erfahren und viele Lehrende bedienen sich
   weltweit dieser Methode. Exemplarisch gibt der nachfolgende Film (3
   Minuten) die Erfahrungen von Prof. Dr. Riegler wieder:

   [[https://www.youtube.com/watch?v=pq9LV1Oj3gs]]

** Installation

   /Stud.IP Cliqr/ ist ein Plugin für das Lernmanagementsystem
   [[https://studip.de][Stud.IP]]. Um das Plugin verwenden zu können, muss der
   Systemadministrator der Stud.IP-Installation das [[https://hilfe.studip.de/admin/Admins/PluginVerwaltung][Plugin
   installieren.]] Das Plugin selbst kann man [[https://github.com/luniki/CliqrPlugin/releases][direkt herunterladen]] oder
   selbst kompilieren (siehe unten).

   Sobald /Stud.IP Cliqr/ in die Stud.IP-Installation aktiviert wurde,
   kann es in jeder Veranstaltung integriert werden: Dazu geht man
   genauso vor, [[https://hilfe.studip.de/help/4.0/de/Basis/VeranstaltungenVerwaltenModule][wie man auch das Forum, den Dateibereich oder das Wiki
   hinzufügen würde.]]

** Kompilieren
   :PROPERTIES:
   :header-args: :dir /tmp/CliqrPlugin
   :END:
Um /Stud.IP Cliqr/ selbst zu kompilieren, benötigt man:

 - [[https://secure.php.net/][PHP]] (mind. v5.6) und
 - [[https://nodejs.org][Node.js]] (und das darin enthaltene =npm=)

Sobald man /Stud.IP Cliqr/ ausgecheckt hat:

#+BEGIN_SRC bash :dir /tmp :results silent
git clone -q https://github.com/luniki/CliqrPlugin.git
cd CliqrPlugin
#+END_SRC

muss [[https://getcomposer.org][Composer]], ein PHP Dependency Manager, installiert werden:

#+BEGIN_SRC bash :results drawer :async
wget "https://getcomposer.org/composer.phar"
#+END_SRC

#+RESULTS:
:RESULTS:
:END:

Nun werden die notwendigen PHP-Pakete mit =composer= installiert:

#+BEGIN_SRC bash :results drawer :async
php composer.phar install --no-dev
#+END_SRC

#+RESULTS:
:RESULTS:
:END:

Zum Kompilieren des JavaScript-Codes benötigen wir JavaScript-Pakete, die mit =npm= installiert werden:

#+BEGIN_SRC bash :results drawer :async
npm install
#+END_SRC

#+RESULTS:
:RESULTS:
added 1214 packages from 686 contributors and audited 9699 packages in 29.569s
found 0 vulnerabilities

:END:

Jetzt kann es mit dem Kompilieren losgehen:

#+BEGIN_SRC bash :results drawer :async
npm run build-prod
#+END_SRC

#+RESULTS:
:RESULTS:

> studip-plugin-cliqr@2.0.0 build-prod /tmp/CliqrPlugin
> webpack --config webpack.prod.js --mode production

Hash: 367aca1846d3be0e9967
Version: webpack 4.12.0
Time: 17804ms
Built at: 2018-07-04 11:59:40
                                 Asset      Size  Chunks             Chunk Names
                             studip.js   204 KiB       4  [emitted]  studip
             task-type.scales.chunk.js  44.8 KiB       0  [emitted]  task-type.scales
             scales-histogram.chunk.js  46.6 KiB       2  [emitted]  scales-histogram
                             polls.css  15.6 KiB       3  [emitted]  polls
                              polls.js   152 KiB       3  [emitted]  polls
                            studip.css  15.6 KiB       4  [emitted]  studip
    task-type.multiple-choice.chunk.js  37.9 KiB       1  [emitted]  task-type.multiple-choice
         task-type.scales.chunk.js.map   114 KiB       0  [emitted]  task-type.scales
task-type.multiple-choice.chunk.js.map  96.7 KiB       1  [emitted]  task-type.multiple-choice
         scales-histogram.chunk.js.map   118 KiB       2  [emitted]  scales-histogram
                          polls.js.map   753 KiB       3  [emitted]  polls
                         studip.js.map   893 KiB       4  [emitted]  studip
 [14] ./error.js 137 bytes {3} {4} [built]
 [37] ./utils.js 1.34 KiB {3} {4} [built]
 [57] ./models/votings.js + 1 modules 2.77 KiB {3} {4} [built]
      | ./models/votings.js 770 bytes [built]
      | ./models/id_list.js 2.01 KiB [built]
[106] (webpack)/buildin/global.js 489 bytes {3} {4} [built]
[107] ./jquery.js 29 bytes {3} {4} [built]
[163] ../scss/core.scss 39 bytes {3} {4} [built]
[164] ./public-path.js 198 bytes {3} {4} [built]
[371] ./polls-app.js + 2 modules 5.64 KiB {3} [built]
      | ./polls-app.js 1.59 KiB [built]
      | ./routers/polls.js 2.17 KiB [built]
      | ./views/polls_index.js 1.82 KiB [built]
[372] ./studip-app.js + 19 modules 42.7 KiB {4} [built]
      | ./views/tasks_show.js 3.57 KiB [built]
      | ./studip-app.js 1.86 KiB [built]
      | ./views/archive.js 1.19 KiB [built]
      | ./routers/studip-fetcher.js 2.69 KiB [built]
      | ./views/votings_show.js 4.39 KiB [built]
      | ./views/task_groups_index.js 2.96 KiB [built]
      | ./views/votings_compare.js 1.89 KiB [built]
      | ./routers/studip.js 4.15 KiB [built]
      | ./views/tasks_edit.js 2.77 KiB [built]
      | ./views/task_groups_show.js 787 bytes [built]
      | ./views/task_groups_edit.js 1.93 KiB [built]
      | ./views/tasks_create.js 3.51 KiB [built]
      | ./views/task_list.js 971 bytes [built]
      | ./models/tasks.js 375 bytes [built]
      | ./views/task_groups_import.js 2.04 KiB [built]
      |     + 5 hidden modules
[375] ../hbs/votings-show.hbs 7.74 KiB {4} [built]
[376] ../hbs/votings-compare.hbs 2.9 KiB {4} [built]
[379] ../hbs/tasks-show.hbs 6.38 KiB {4} [built]
[380] ../hbs/tasks-edit.hbs 775 bytes {4} [built]
[381] ../hbs/tasks-create.hbs 3.36 KiB {4} [built]
[382] ../hbs/task-groups-show.hbs 1.69 KiB {4} [built]
    + 401 hidden modules
Child mini-css-extract-plugin ../../node_modules/css-loader/index.js??ref--4-1!../../node_modules/postcss-loader/lib/index.js!../scss/core.scss:
    [1] /tmp/CliqrPlugin/node_modules/css-loader??ref--4-1!/tmp/CliqrPlugin/node_modules/postcss-loader/lib!../scss/core.scss 21.7 KiB {0} [built]
        + 1 hidden module
:END:

Zum Schluß muss noch das Stud.IP-Plugin gepackt werden:

#+BEGIN_SRC bash :results drawer :async
npm run zip > /dev/null
#+END_SRC

#+RESULTS:
:RESULTS:
:END:

Das Endergebnis ist eine fertige ZIP-Datei, die in Stud.IP-Installationen wie üblich eingespielt werden kann.

#+BEGIN_SRC bash :results raw :exports none
echo "[[file:$(pwd)/cliqr.zip]]"
#+END_SRC

#+RESULTS:
[[file:/tmp/CliqrPlugin/cliqr.zip]]
